[
    {
      "Rank": 50,
      "Artist": "Jay-Z",
      "Album": "The Blueprint",
      "Info": "Roc-A-Fella, 2001",
      "Description":"With The Blueprint, Jay-Z took on anyone and everyone who wanted to sit on his throne, even the jesters. Takeover, one of rap's most precise and unrelenting diss tracks, commits GBH on rappers Nas and Prodigy from Mobb Deep. When Hova isn't taking shots at record executives, cops, critics, haters, biters, and his absent dad (and still, sadly, using the word 'faggot'), he inches toward vulnerability on 'Song Cry.', 'Izzo (H.O.V.A.)', with dynamic production by Kanye West, gave him his first Top 10 single. Jay-Z elevates clever rhymes and innovations with an unmatched air of calm control and a cavalier confidence. Here's the moral of the story, courtesy of Takeover: 'You guys don't want it with HOV'",
      "Image":"https://upload.wikimedia.org/wikipedia/en/2/2c/The_Blueprint.png"
    },
    {
      "Rank": 49,
      "Artist": "OutKast",
      "Album": "Aquemini",
      "Info": "LaFace, 1998",
      "Description": "The title of OutKast's third album is a made-up word that combines the star signs of Big Boi (Aquarius) and Andre 3000 (Gemini). Their music is about duality too, matching Big Boi's imperative to make the club get crunkin with Andre's determination to activate the left and right brain. Andre was the virtuoso, clipping off compound rhymes with grace, while Big Boi's more grounded flow and clear diction rooted their songs. Hits like 'Rosa Parks' put the duo's hometown Hotlanta's on the rap map, and at a time when formulaic albums by Master P and Puff Daddy topped the charts.",
      "Image": "https://upload.wikimedia.org/wikipedia/en/2/2c/AqueminiOutKast.jpg"
    },
    {
      "Rank": 48,
      "Artist": "Bob Marley and the Wailers",
      "Album": "Legend",
      "Info": "Island, 1984",
      "Description": "Bob Marley said, 'Reggae music too simple for [American musicians]. You must be inside of it, know what's happening, and why you want to play this music. You don't just run to play this music because you think you can make a million off it.  Ironically, this set of the late reggae idol's greatest hits has sold in the millions. On a single disc, it captures everything that made him an international icon",
      "Image":"https://m.media-amazon.com/images/I/71EFb-BEAeL._SX355_.jpg"
    },
    {
      "Rank": 47,
      "Artist": "Ramones",
      "Album": "Ramones",
      "Info": "Sire, 1976",
      "Description": "Frustrated by the experience of writing good songs that didn't come to life in the studio, Paul Simon set out 'to make really good tracks,  as he later put it. 'I thought,  ˜I have enough songwriting technique that I can reverse this process and write this song after the tracks are made.'  Simon risked severe criticism by going to South Africa (then under apartheid) and working with the best musicians from the black townships. With the fluid energy and expertise of guitarist Ray Phiri and the vocal troupe Ladysmith Black Mambazo, Simon created an album about isolation and redemption that transcended world music to become the whole world's soundtrack.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/b/bb/Ramones_-_Ramones_cover.jpg"
    },
    {
      "Rank": 46,
      "Artist": "Paul Simon",
      "Album": "Graceland",
      "Info": "Columbia, 1986",
      "Description": "Frustrated by the experience of writing good songs that didn't come to life in the studio, Paul Simon set out 'to make really good tracks,  as he later put it. 'I thought,  ˜I have enough songwriting technique that I can reverse this process and write this song after the tracks are made.'  Simon risked severe criticism by going to South Africa (then under apartheid) and working with the best musicians from the black townships. With the fluid energy and expertise of guitarist Ray Phiri and the vocal troupe Ladysmith Black Mambazo, Simon created an album about isolation and redemption that transcended world music to become the whole world's soundtrack.",
      "Image":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Graceland_cover_-_Paul_Simon.jpg/330px-Graceland_cover_-_Paul_Simon.jpg"
    },
    {
      "Rank": 45,
      "Artist": "Prince",
      "Album": "Sign O' the Times",
      "Info": "Paisley Park/Warner Bros., 1987",
      "Description": "He'd fired his band, and his latest movie, Under the Cherry Moon, had flopped; just three years after Purple Rain, Prince was in the market for a comeback. So he recorded one of the great albums of the Eighties. Times is best known for the apocalyptic title track, the brontosaurus funk of 'Housequake,  and the gorgeous 'If I Was Your Girlfriend.  Yet the simplest moments are unforgettable: the 'Sweet Jane -style guitar plea of 'The Cross,  the Stax revamp on 'Slow Love,  a jilted girl's sadness in 'I Could Never Take the Place of Your Man.  'I hate the word  experiment,' Prince said. 'It sounds like something you didn't finish. Here, he finished.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/1/16/Prince-SignOTheTimes.jpg"
    },
    {
      "Rank": 44,
      "Artist": "Nas",
      "Album": "Illmatic",
      "Info": "Columbia, 1994",
      "Description": "Other rappers were harder and brasher, but nobody captured the creeping menace of life on the streets like this 20-year-old from New York's Queensbridge projects. With lines like 'I never sleep, 'cause sleep is the cousin of death,  Nas showed more poetic style than any MC since Rakim. His debut begins with the sound of a subway train, and for the next 39 minutes, he seems to visit every street corner from Queens to Brooklyn, detailing drug deals, escapism, persecution, prison life, and survival.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/2/27/IllmaticNas.jpg"
    },
    {
      "Rank": 43,
      "Artist": "A Tribe Called Quest",
      "Album": "The Low End Theory",
      "Info": "Jive, 1991",
        "Description": "'We wanted the longevity of Earth, Wind, and Fire, and Prince, and people of that nature,  Phife Dawg told Rolling Stone. 'We wanted to be known for full-length albums.  Other people connected the dots between hip-hop and jazz , but A Tribe ˆCalled Quest's second album drew the entire picture. The sound is dominated by the low end of the title  ” they even recruited legendary jazz bassist Ron Carter (who'd worked with Thelonious Monk and Miles Davis).",
        "Image":"https://upload.wikimedia.org/wikipedia/en/4/42/ATribeCalledQuestTheLowEndtheory.jpg"
    },
    {
      "Rank": 42,
      "Artist": "Radiohead",
      "Album": "OK Computer",
      "Info": "Capitol, 1997",
      "Description": "Radiohead recorded their third album in the mansion of actress Jane Seymour while she was filming Dr. Quinn, Medicine Woman. OK is where the band began pulling at its sound like taffy, seeing what happened, not worrying if it was still 'rock.  What resulted is a slow, haunting album with unforgettable tracks such as 'Karma Police.  Guitarist Jonny Greenwood said, 'I got very excited at the prospect of doing string parts that didn't sound like  Eleanor Rigby,' which is what all string parts have sounded like for the past 30 years.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/b/ba/Radioheadokcomputer.png"
    },
    {
      "Rank": 41,
      "Artist": "The Rolling Stones",
      "Album": "Let It Bleed",
      "Info": "ABKCO, 1969",
      "Description": "The record kicks off with the terrifying 'Gimme Shelter,  the song that came to symbolize not only the catastrophe of the Stones' free show at Altamont but also the death of the utopian spirit of the 1960s. And the entire album burns with apocalyptic cohesion: the sex-mad desperation of 'Live With Me ; the murderous blues of 'Midnight Rambler ; Keith Richards' lethal, biting guitar on 'Monkey Man ; the epic moralism, with honky-tonk piano and massed vocal chorus, of 'You Can't Always Get What You Want,  which Mick Jagger wrote on acoustic guitar in his bedroom.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/c/c0/LetitbleedRS.jpg"
      
    },
    {
      "Rank": 40,
      "Artist": "David Bowie",
      "Album": "The Rise and Fall of Ziggy Stardust and the Spiders From Mars",
      "Info": "RCA, 1972",
      "Description": "This album documents one of the most elaborate self-mythologizing schemes in rock, as David Bowie created the glittery, messianic alter ego Ziggy Stardust ('well-hung and snow-white tan ). The glam rock Bowie made with guitarist Mick Ronson is an irresistible blend of sexy, campy pop and blues power, with enduring tracks like 'Hang On to Yourself  and 'Suffragette City.  The anthem 'Ziggy Stardust  was one of rock's earliest, and best, power ballads. 'I consider myself responsible for a whole new school of pretensions, Bowie said.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/0/01/ZiggyStardust.jpg"
    },
    {
      "Rank": 39,
      "Artist": "Talking Heads",
      "Album": "Remain in Light",
      "Info": "Sire, 1980",
      "Description": "David Byrne said Remain in Light 'was done in bits and pieces, one instrument at a time.  The result was a New Wave masterpiece powered by Byrne's revelation, as he put it on 'The Great Curve,  that 'the world moves on a woman's hips.  It combined thrust of a P-Funk dance party, the ancient-to-the-future rhythm hypnosis of Nigerian funkmaster Fela Kuti, and the studied adventurousness of the album's producer and Heads co-conspirator, Brian Eno. Remain in Light marked Talking Heads' transformation from avatars of the punk avant-garde to polyrhythmic magicians with hit-single appeal. Just try not dancing to 'Once in a Lifetime.'",
      "Image":"https://upload.wikimedia.org/wikipedia/en/2/2d/TalkingHeadsRemaininLight.jpg"
    },
    {
      "Rank": 38,
      "Artist": "Bob Dylan",
      "Album": "Blonde on Blonde",
      "Info": "Columbia, 1966",
      "Description": "Rock's first studio double LP by a major artist was, as Bob Dylan declared in 1978, 'the closest I ever got to the sound I hear in my head that thin, that wild-mercury sound. Blonde on Blonde was mainly recorded in Nashville with session pros (another rock first), who created an almost contradictory magnificence: a tightly wound tension around Dylan's quicksilver language and incisive singing in barrelhouse surrealism such as 'Rainy Day Women #12 and 35  and 'Stuck Inside of Mobile With the Memphis Blues Again.  Amid the frenzy, Dylan delivered some of his ï¬nest, clearest songs of comfort and desire: the sidelong beauty 'Sad Eyed Lady of the Lowlands  and 'I Want You,  the title of which Dylan almost used for the album.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/3/38/Bob_Dylan_-_Blonde_on_Blonde.jpg"
    },
    {
      "Rank": 37,
      "Artist": "Dr. Dre",
      "Album": "The Chronic",
      "Info": "Deathrow, 1992",
      "Description":"When George Clinton first heard hip-hop artists blending old records with new beats, he wasn't too impressed. But then Dr. Dre turned samples of Clinton's P-Funk sides into G-Funk, and Dr. Funkenstein approved, calling funk 'the DNA of hip-hop and rap.  Dre had already taken gangsta rap to the mainstream with his earlier group, N.W.A, but on The Chronic, he funked up the rhymes with a smooth bass-heavy production style and the laid-back delivery of then-unknown rapper Snoop Doggy Dogg. When Dre and Snoop dropped 'Nuthin' But a G' Thang,  there was no getting out of the way.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/1/19/Dr.DreTheChronic.jpg"
    },
    {
      "Rank": 36,
      "Artist": "Michael Jackson",
      "Album": "Off the Wall",
      "Info": "Epic, 1979",
      "Description":"'The ballads were what made Off the Wall a Michael Jackson album,  Jackson remembered of his big solo splash, which spun off four Top 10 hits and eclipsed the success of the Jackson 5. 'I'd done ballads with [my] brothers, but they had never been too enthusiastic about them and did them more as a concession to me than anything else.  At the end of 'She's Out of My Life,  you can hear Jackson actually break down and cry in the studio. But the unstoppable dance tracks on Off the Wall remain classic examples of Jackson as a one-man disco inferno. 'Don't Stop Til You Get Enough, 'Rock With You, and 'Burn This Disco Out  still get the party started today.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/f/f6/Off_the_wall.jpg"
    },
    {
      "Rank": 35,
      "Artist": "The Beatles",
      "Album": "Rubber Soul",
      "Info": "Parlophone, 1965",
      "Description":"Producer George Martin described Rubber Soul as 'the first album to present a new, growing Beatles to the world, and so it was. The first of what was to be a series of huge leaps forward with each new album, Rubber Soul opens with the comic character study 'Drive My Car and is suffused with Bob Dylan's influence on 'I'm Looking Through You, 'You Won't See Me,  and 'Norwegian Wood,  in which John Lennon sings about sex with a humor and candor unlike any rock & roller before and George Harrison lays down rock's first sitar solo. Harrison called Rubber Soul 'the best one we made, because 'we were suddenly hearing sounds that we weren't able to hear before.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/7/74/Rubber_Soul.jpg"

    },
    {
      "Rank": 34,
      "Artist": "Stevie Wonder",
      "Album": "Innervisions",
      "Info": "Tamla/Motown, 1973",
      "Description":"'We as a people are not interested in  'baby, baby' songs any more, there's more to life than that,  Stevie Wonder said in 1972. With Innervisions, Wonder offered a landmark fusion of social realism and spiritual idealism; he brings expressive color and irresistible funk to his synth-based keyboards on 'Too High  (a cautionary anti-drug song) and 'Higher Ground  (which echoes Martin Luther King Jr.'s message of transcendence). The album's centerpiece is 'Living for the City,  a cinematic depiction of exploitation and injustice. 'Innervisions gives my own perspective on what's happening in my world, Wonder said. 'I think it is my most personal album. I don't care if it sells only five copies. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/3/3b/Steviewonder_innervisions.jpg"
    },
    {
      "Rank": 33,
      "Artist": "Amy Winehouse",
      "Album": "Back to Black",
      "Info": "Island, 2006",
      "Description":"With her love of Sixties girl-group pop and her dark beehive, Amy Winehouse came across as a star from another time. But as a child of the Nineties, she also loved hip-hop and wrote openly about her splattered relationships and issues with drugs and alcohol. Her breakthrough second album (recorded in Brooklyn with co-producers Mark Ronson and Salaam Remi) marked the arrival of a resplendently damaged 21st-century torch singer.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/6/67/Amy_Winehouse_-_Back_to_Black_%28album%29.png"
    },
    {
      "Rank": 32,
      "Artist": "Beyonce",
      "Album": "Lemonade",
      "Info": "Parkwood/Columbia, 2016",
      "Description":"'Nine times out of 10 I'm in my feelings, Beyonce announced on her heartbreak masterpiece, Lemonade. She dropped the album as a Saturday-night surprise, knocking the world sideways  ” her most expansive and personal statement, tapping into marital breakdown and the state of the nation. It was a different side than she'd shown before, raging over infidelity and jealousy, but reveling in the militant-feminist-funk strut of 'Formation.  All over Lemonade she explores the betrayals of American blackness, claiming her place in all of America's music traditions  ” she goes outlaw country on 'Daddy Lessons,  she digs blues metal with Jack White on 'Don't Hurt Yourself,  she revamps the Yeah Yeah Yeahs on 'Hold Up.  Ashes to ashes, dust to side chicks  ” all hail the queen.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/5/53/Beyonce_-_Lemonade_%28Official_Album_Cover%29.png"
    },
    {
      "Rank": 31,
      "Artist": "Miles Davis",
      "Album": "Kind of Blue",
      "Info": "Columbia, 1959",
      "Description":"This painterly masterpiece is one of the most important, influential, and popular albums in jazz. At the time it was made, Kind of Blue was also a revolution all its own. Turning his back on standard chord progressions, trumpeter Miles Davis used modal scales as a starting point for composition and improvisation  ” breaking new ground with warmth, subtlety, and understatement in the thick of hard bop. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/9/9c/MilesDavisKindofBlue.jpg"
    },
    {
      "Rank": 30,
      "Artist": "Jimi Hendrix",
      "Album": "Are You Experienced",
      "Info": "Track, 1967",
      "Description":"This is what Britain sounded like in late 1966 and early 1967: ablaze with rainbow blues, orchestral guitar feedback, and cosmic possibility. Jimi Hendrix's incendiary guitar was historic in itself, the luminescent sum of his chitlin-circuit labors with Little Richard and the Isley Brothers and his melodic exploitation of amp howl. But it was the pictorial heat of songs like 'Manic Depression and 'The Wind Cries Mary  that established the transcendent promise of psychedelia. Backed by drummer Mitch Mitchell and bassist Noel Redding, the guitarist made soul music for inner space. 'It's a collection of free feeling and imagination,  he said of the album.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/1/17/AreyouexpUK.jpg"

    },
    {
      "Rank": 29,
      "Artist": "The Beatles",
      "Album": "White Album",
      "Info": "Apple, 1968",
      "Description":"They wrote the songs while on retreat with the Maharishi Mahesh Yogi in India, taking a break from the celebrity grind. As John Lennon later said, 'We sat in the mountains eating lousy vegetarian food, and we wrote all these songs.  They came back with more great tunes than they could release. Lennon pursued his hard-edged vision in the cynical wit of 'Sexy Sadie  and 'Happiness Is a Warm Gun,   as well as the childlike yearning of 'Julia  and 'Dear Prudence.   Paul McCartney's playful pop energy came through in 'Martha My Dear   and his inversion of Chuck Berry's American values, 'Back in the U.S.S.R.  George Harrison's spiritual yearning led him to 'Long, Long, Long   and 'While My  Guitar Gently Weeps,   featuring a guest guitar solo from  Eric Clapton.",
      "Image":"https://upload.wikimedia.org/wikipedia/commons/2/20/TheBeatles68LP.jpg"
    },
    {
      "Rank": 28,
      "Artist": "DeAngelo",
      "Album": "Voodoo",
      "Info": "EMI, 2000",
      "Description":"In the five years following the release of his 1995 debut, Brown Sugar, D'Angelo grew disillusioned with the genre that had just anointed him a rising star. 'I don't consider myself an R&B artist,  the then-26-year-old told Jet. 'R&B is pop, that's the new word for R&B.  In his quest to create something new, he looked to both the masters of soul (Marvin, Curtis, Stevie) and contemporary innovators (Lauryn, Erykah). The end result was Voodoo, a moving, inventive masterpiece that stands as the ultimate achievement of the neo-soul era.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/c/cc/Voodoo_UK.jpg"
    },
    {
      "Rank": 27,
      "Artist": "Wu-Tang Clan",
      "Album": "Enter the Wu-Tang(36 Chambers)",
      "Info": "Loud, 1993",
      "Description": "The first Wu-Tang Clan album launched rap's most dominant franchise by inventing a new sound built around a hectic panoply of voices and spare, raw beats. RZA, the group's sonic mastermind, constructed the Wu's homemade world, he said, from a mix of 'Eastern philosophy picked up from kung-fu movies, watered-down Nation of Islam preaching picked up on the New York streets, and comic books. RZA's offbeat samples create a grounding for the group's nine members, including future solo stars Ol' Dirty Bastard, Raekwon, GZA, Ghostface Killah, and Method Man. Dr. Dre and Snoop Dogg had established L.A. as the center of hip-hop innovation and daring, but the Wu reclaimed the crown for the music's birthplace.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/5/53/Wu-TangClanEntertheWu-Tangalbumcover.jpg"
    },
    {
      "Rank": 26,
      "Artist": "Patti Smith",
      "Album": "Horses",
      "Info": "Arista, 1975",
      "Description":"From its first defiant line, 'Jesus died for somebody's sins, but not mine,  the opening shot in a bold reinvention of Van Morrison's garage-rock classic 'Gloria,  Patti Smith's debut album was a declaration of mutiny, a statement of faith in the transfigurative powers of rock & roll. Horses made her the queen of punk (her CBGB buddy Tom Verlaine of Television co-wrote the Jim Morrison tribute 'Break It Up ), but Smith cared more for the poetry in rock.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/8/88/PattiSmithHorses.jpg"
    },
    {
      "Rank": 25,
      "Artist": "Carole King",
      "Album": "Tapestry",
      "Info": "Sony, 1971",
      "Description":"For a decade, Carole King wrote pop songs with her then-husband, Gerry Goffin: hits such as Little Eva's 'The Loco-Motion  (Eva Boyd was the couple's babysitter) and the Monkees' 'Pleasant Valley Sunday.  Then King's friend James Taylor encouraged her to sing her own tunes. 'He just made it look so easy,  she recalled. 'So I did Tapestry in the same spirit.  She slowed down 'Will You Love Me Tomorrow?  (originally a hit for the Shirelles in 1961), with Taylor and Joni Mithcell on background vocals, heightening the melancholy inside, while her warm, earnest singing brought out the sadness in 'It's Too Late  and the earthy joy on 'I Feel the Earth Move.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/5/52/Carole_King_-_Tapestry.jpg"
    },
    {
      "Rank": 24,
      "Artist": "The Beatles",
      "Album": "Sgt. Pepper's Lonely Hearts Club Band",
      "Info": "Capitol, 1967",
      "Description":"McCartney said decades later. 'We were not boys, we were men artists rather than performers.  Sgt. Pepper christened the Summer of Love with the lavish psychedelic daydream 'Lucy in the Sky With Diamonds,  the jaunty Ringo Starr-sung communality anthem 'With a Little Help From My Friends,  the album-closing multilayered masterwork, 'A Day in the Life,  and the title track, which introduced the alter egos the Beatles had developed for the ambitious project. 'It liberated you,  McCartney said.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/5/50/Sgt._Pepper%27s_Lonely_Hearts_Club_Band.jpg"
    },
    {
      "Rank": 23,
      "Artist": "The Velvet Underground",
      "Album": "The Velvet Underground and Nico",
      "Info": "Verve, 1967",
      "Description": "Spector thing with as few instruments as possible,  John Cale, the classically trained pianist and viola player of the Velvet Underground, once said of this record. It was no idle boast. Much of what we take for granted in rock would not exist without this New York band or its seminal debut: the androgynous sexuality of glitter, punk's raw noir, the blackened-riff howl of grunge and noise rock. It is a record of fearless breadth and lyrical depth. Singer-songwriter Lou Reed documented carnal desire and drug addiction with a pop wisdom he learned as a song-factory composer for Pickwick Records.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/0/0c/Velvet_Underground_and_Nico.jpg"
    },
    {
      "Rank": 22,
      "Artist": "The Notorious B.I.G.",
      "Album": "Ready to Die",
      "Info": "Bad Boy, 1994",
      "Description":"The Notorious B.I.G. spread the love the Brooklyn way on his classic debut, introducing us to the most immediately likable voice in hip-hop history. 'I made the record for New York, but I want the world to hear it,  he said. Ready to Die executive producer Sean 'Puffy  Combs, who'd read about the fledgling Brooklyn rapper in The Source magazine, pushed his new discovery to leaven the stick-up-kid self-mythologizing of 'Machine Gun Funk  and 'Gimme the Loot  with inviting party-up pop like 'Big Poppa  and the ecstatically playful origin story 'Juicy. But it was Biggie's gift of gab, enormous personality, and sense of humor that made Ready to Die so wonderful",
      "Image":"https://upload.wikimedia.org/wikipedia/en/9/97/Ready_To_Die.jpg"
    },
    {
      "Rank": 21,
      "Artist": "Bruce Springsteen",
      "Album": "Born to Run",
      "Info": "Columbia, 1975",
      "Description":"Bruce Springsteen spent everything he had  ” patience, energy, studio time, the physical endurance of his E Street Band  ” to ensure that his third album was a masterpiece. His reputation as a perfectionist begins here:  There are a dozen guitar overdubs on the title track alone. He was also spending money he didn't have. Engineer Jimmy Iovine had to hide the mounting recording bills from the Columbia paymasters. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/7/7a/Born_to_Run_%28Front_Cover%29.jpg"
    },
    {
      "Rank": 20,
      "Artist": "Radiohead",
      "Album": "Kid A",
      "Info": "Parlophone, 2000",
      "Description":"A new, uniquely fearless kind of rock record for a new, increasingly fearful century, Radiohead's fourth album, released in October 2000, remains one of the more stunning sonic makeovers in music history. The band had the freedom to do whatever it wanted after its 1997 alt-rock breakthrough, OK Computer [see No. 42]. 'Everyone expected us to become this U2 type of band, with that stadium credibility, bassist Colin Greenwood said in 2001. Instead, frontman Thom Yorke gorged on albums by avant-techno innovator Aphex Twin and other artists on the Warp Records roster, inspiring him to put down his guitar and embrace the glacial beauty of abstract electronics, glitchy beats, and the challenge of free-form composition. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/0/02/Radioheadkida.png"
    },
    {
      "Rank": 19,
      "Artist": "Kendrick Lamar",
      "Album": "To Pimp a Butterfly",
      "Info": "TDE, 2015",
      "Description": "Kendrick Lamar had already proven himself hip-hop's boldest visionary  ” so by now, people expected greatness from him. But he topped himself with To Pimp a Butterfly  ” a sprawling, ambitious portrait of America and his dangerous place in it, with a host of jazz influences. 'It's a unique sound,  said longtime Lamar producer Mark 'Sounwave  Spears. 'Every producer I've ever met was sending me stuff [for the album], but there was a one-in-a-million chance you could send a beat that actually fit what we were doing.  As Lamar said when the album was released, 'I pride myself on writing now rather than rapping. My passion is bringing storylines around and constructing a full body of work, rather than just a 16-bar verse.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/f/f6/Kendrick_Lamar_-_To_Pimp_a_Butterfly.png"
    },
    {
      "Rank": 18,
      "Artist": "Bob Dylan",
      "Album": "Highway 61 Revisited",
      "Info": "Columbia, 1965",
      "Description":"Bruce Springsteen has described the beginning of 'Like a Rolling Stone,  the opening song on Bob Dylan's Highway 61 Revisited, as the 'snare shot that sounded like somebody'd kicked open the door to your mind.  In and of itself, 'Like a Rolling Stone,  which was rumored to be about Andy Warhol acolyte Edie Sedgwick, forever altered the landscape of popular music  ” its 'vomitif lyrics (in Dylan's memorable term), literary ambition, and sheer length (6:13) shattered limitations of every kind. But that was literally only the beginning. The rest of the album, recorded in a shocking six days, was just as revelatory. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/9/95/Bob_Dylan_-_Highway_61_Revisited.jpg"
    },
    {
      "Rank": 17,
      "Artist": "Kanye West",
      "Album": "My Beautiful Dark Twisted Fantasy",
      "Info": "Roc-A-Fella, 2010",
      "Description":"Our relationship with Kanye West was still in its love-hate phase when he created the 21st century's most awe-inspiring hip-hop masterpiece. It's an album every bit as chaotic as he was at the time  ” from the creepy funk of 'Gorgeous  to the crushing attack of 'Hell of a Life.  After his Taylor Swift VMAs fiasco in 2009, West went into a kind of self-exile, eventually ending up in Hawaii, where he imported a huge group of collaborators who included Justin Vernon of Bon Iver, Nicki Minaj, and RZA. In all-night recording sessions, he'd ping between studios, sculpting his most maximalist music ever",
      "Image":"https://upload.wikimedia.org/wikipedia/en/f/f0/My_Beautiful_Dark_Twisted_Fantasy.jpg"
    },
    {
      "Rank": 16,
      "Artist": "The Clash",
      "Album": "London Calling",
      "Info": "CBS, 1979",
      "Description":"Stevens was on hand for inspiration. He threw chairs around the room 'if he thought a track needed zapping up,  according to Strummer. The album ends with 'Train in Vain,  a rousing song of infedelity (originally unlisted on the back cover) that became the sound of triumph: the Clash's first Top 30 single in the U.S",
      "Image":"https://upload.wikimedia.org/wikipedia/en/0/00/TheClashLondonCallingalbumcover.jpg"
    },
    {
      "Rank": 15,
      "Artist": "Public Enemy",
      "Album": "It Takes a Nation of Millions to Hold Us Back",
      "Info": "Def Jam, 1988",
      "Description":"Loud, obnoxious, funky, avant-garde, political, uncompromising, hilarious  “ Public Enemy's brilliant second album is all of these things  ” all at once. Chuck D booms intricate rhymes with a delivery inspired by sportscaster Marv Albert; sidekick Flavor Flav raps comic relief; and production team the Bomb Squad build mesmerizing, multilayered jams, pierced with shrieking sirens. The title and roiling force of 'Bring the Noise  is truth in advertising. 'If they're calling my music  'noise,'   said Chuck D, 'if they're saying that I'm really getting out of character being a black person in America, then fine  “ I'm bringing more noise.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/7/73/PublicEnemyItTakesaNationofMillionstoHoldUsBack.jpg"
    },
    {
      "Rank": 14,
      "Artist": "The Rolling Stones",
      "Album": "Exile on Main Street",
      "Info": "Rolling Stones Records, 1972",
      "Description":"A dirty whirl of basement blues and punk boogie, the Rolling Stones' 1972 double LP was, according to Keith Richards, 'maybe the best thing we did.  Indeed, inside its deliberately dense squall  ” Richards' and Mick Taylor's dogï¬ght riffing, the lusty jump of the Bill Wyman “Charlie Watts rhythm engine, Mick Jagger's caged-animal bark and burned-soul croon  ” is the Stones' greatest album and Jagger and Richards' deï¬nitive songwriting statement of outlaw pride and dedication to grit and cold-morning redemption. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/c/ca/ExileMainSt.jpg"
    },
    {
      "Rank": 13,
      "Artist": "Aretha Franklin",
      "Album": "I Never Loved a Man the Way I Love You",
      "Info": "Atlantic, 1967",
      "Description":"Aretha Franklin's Atlantic debut is the place where gospel music collided with R&B and rock & roll and became soul. The Detroit-born preacher's daughter was about $80,000 in debt to her previous label, Columbia, when Atlantic producer Jerry Wexler signed her in 1966. 'I took her to church,  Wexler said, 'sat her down at the piano, and let her be herself.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/1/15/Aretha_Franklin_%E2%80%93_I_Never_Loved_a_Man_the_Way_I_Love_You.jpg"
    },
    {
      "Rank": 12,
      "Artist": "Michael Jackson",
      "Album": "Thriller",
      "Info": "Epic, 1982",
      "Description":"Michael Jackson towered over the Eighties the way no superstar before or since has dominated an era  ” not even Elvis or the Beatles. And Thriller is the reason why. Still in his early twenties, the R&B child star of the 1970s had ripened into a Technicolor soul man: a singer, dancer, and songwriter with incomparable crossover instincts.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/5/55/Michael_Jackson_-_Thriller.png"
    },
    {
      "Rank": 11,
      "Artist": "The Beatles",
      "Album": "Revolver",
      "Info": "Apple, 1966",
      "Description":"Revolver was the sound of the Beatles fully embracing the recording studio as a sonic canvas, free to pursue musical ideas and possibilities that would reshape rock forever. It speaks volumes that the first song the band worked on upon entering Abbey Road studios in April 1966 would have been impossible to replicate live  ” a swirl of hazy guitar, backward tape loops, kaleidoscopic drum tumble, and John Lennon's voice recorded to sound like 'the Dalai Lama singing from the highest mountaintop.  They titled it 'The Void  and later renamed it 'Tomorrow Never Knows.  'I was wondering how George Martin would take it,  Paul McCartney later recalled. Martin's response: 'Jolly interesting. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/e/ec/Revolver_%28album_cover%29.jpg"
    },
    {
      "Rank": 10,
      "Artist": "Lauryn Hill",
      "Album": "The Miseducation of Lauryn Hill",
      "Info": "Ruffhouse/Columbia, 1998",
      "Description":"This is a very sexist industry,  Lauryn Hill told Essence magazine in 1998. 'They'll never throw the  'genius' title to a sister.  Though already a star as co-leader of the Fugees, with Wyclef Jean, she was hungry to express her own vision. '[I wanted to] write songs that lyrically move me and have the integrity of reggae and the knock of hip-hop and the instrumentation of classic soul,  the singer said of her debut album.",
      "Image":  "https://upload.wikimedia.org/wikipedia/en/5/55/LaurynHillTheMiseducationofLaurynHillalbumcover.jpg"  
    },
    {
      "Rank": 9,
      "Artist": "Bob Dylan",
      "Album": "Blood on the Tracks",
      "Info": "Columbia, 1975",
      "Description":"Bob Dylan once introduced this album's opening song, 'Tangled Up in Blue,  onstage as taking him 10 years to live and two years to write. It was, for him, a pointed reference to the personal crisis  ” the collapse of his marriage to Sara Lowndes  ” that at least partly inspired this album, Dylan's best of the 1970s. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/f/fa/Bob_Dylan_-_Blood_on_the_Tracks.jpg"
    },
    {
      "Rank": 8,
      "Artist": "Prince and the Revolution",
      "Album": "Purple Rain",
      "Info": "Warner Bros., 1984",
      "Description":"I think Purple Rain is the most avant-garde,  'purple' thing I've ever done,  Prince told Ebony in 1986. He was still a rising star with only a couple of hits when he got the audacious idea to make a movie based on his life, and make his next LP the movie's soundtrack. When it was released in 1984, he became the first artist to have the Number One song, album, and movie in North America. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/9/9c/Princepurplerain.jpg"
    },
    {
      "Rank": 7,
      "Artist": "Fleetwood Mac",
      "Album": "Rumours",
      "Info": "Warner Bros., 1977",
      "Description":"With Rumours, Fleetwood Mac turned private turmoil into gleaming, melodic public art. The band's two couples  ” bassist John McVie and singer-keyboard player Christine McVie, who were married; guitarist Lindsey Buckingham and vocalist Stevie Nicks, who were not  ” broke up during the protracted sessions for the album. As John later told Rolling Stone of the atmosphere during the making of Rumours, 'Parties going on all over the house. Amazing. Terrifying. Huge amounts of illicit materials, yards and yards of this wretched stuff. Days and nights would just go on and on. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/f/fb/FMacRumours.PNG"
    },
    {
      "Rank": 6,
      "Artist": "Nirvana",
      "Album": "Nevermind",
      "Info": "Geffen, 1991",
      "Description":"An overnight-success story of the 1990s, Nirvana's second album and its totemic ï¬rst single, 'Smells Like Teen Spirit,  shot up from the Northwest underground  ” the nascent grunge scene in Seattle  ” to kick Michael Jackson's Dangerous off the top of the Billboard charts and blow hair metal off the map. Few albums have had such an overpowering impact on a generation  ” a nation of teens suddenly turned punk  ” and such a catastrophic effect on its main creator. The weight of success led already-troubled singer-guitarist Kurt Cobain to take his own life in 1994.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/b/b7/NirvanaNevermindalbumcover.jpg"
    },
    {
      "Rank": 5,
      "Artist": "The Beatles",
      "Album": "Abbey Road",
      "Info": "Apple, 1969",
      "Description":"It was a very happy record,  said producer George Martin, describing this album in The Beatles Anthology. 'I guess it was happy because everybody thought it was going to be the last.  Indeed, Abbey Road  ” recorded in two months during the summer of 1969  ” almost never got made at all. That January, the Beatles were on the verge of a breakup, exhausted and angry with one another after the disastrous sessions for the aborted Get Back LP, later salvaged as Let It Be.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/4/42/Beatles_-_Abbey_Road.jpg"
    },
    {
      "Rank": 4,
      "Artist": "Stevie Wonder",
      "Album": "Songs in the Key of Life",
      "Info": "Tamla/Motown, 1976",
      "Description":"Months before the recording sessions for Songs in the Key of Life ended, the musicians in Stevie Wonder's band had T-shirts made up that proclaimed, 'We're almost finished.  It was the stock answer to casual fans and Motown executives and everybody who'd fallen in love with Wonder's early-Seventies gems  “ 1972's Talking Book, 1973's Innervisions, and 1974's Fulfillingness' First Finale  “ and who had been waiting two years for the next chapter. 'I believed there was a lot that needed to be said,  Wonder said. More, in fact, than he could fit onto a double album  “ also included was a bonus EP, a seven-inch single with four more songs from the sessions.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/e/e2/Songs_in_the_key_of_life.jpg"
    },
    {
      "Rank": 3,
      "Artist": "Joni Mitchell",
      "Album": "Blue",
      "Info": "Reprise, 1971",
      "Description":"In 1971, Joni Mitchell represented the West Coast feminine ideal  ” celebrated by Robert Plant as 'a girl out there with love in her eyes and flowers in her hair  on Led Zeppelin's 'Goin' to California.  It was a status that Mitchell hadn't asked for and did not want: 'I went,  'Oh, my God, a lot of people are listening to me,'  she recalled in 2013. ''They better find out who they're worshiping. Let's see if they can take it. Let's get real.' So I wrote Blue. ",
      "Image":"https://upload.wikimedia.org/wikipedia/en/e/e1/Bluealbumcover.jpg"
    },
    {
      "Rank": 2,
      "Artist": "The Beach Boys",
      "Album": "Pet Sounds",
      "Info": "Capitol, 1966",
      "Description":"Who's gonna hear this shit?  Beach Boys singer Mike Love asked the band's resident genius, Brian Wilson, in 1966, as Wilson played him the new songs he was working on. 'The ears of a dog?  Confronted with his bandmate's contempt, Wilson made lemonade of lemons. 'Ironically,  he observed, 'Mike's barb inspired the album's title. Barking dogs  “ Wilson's dog Banana among them, in fact  “ are prominent among the found sounds on the album. The Beatles made a point of echoing them on Sgt. Pepper's Lonely Hearts Club Band  “ an acknowledgment that Pet Sounds was the inspiration for the Beatles' masterpiece.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/b/bb/PetSoundsCover.jpg"
    },
    {
      "Rank": 1,
      "Artist": "Marvin Gaye",
      "Album": "What's Going On",
      "Info": "Tamla/Motown, 1971",
      "Description":"Marvin Gaye's masterpiece began as a reaction to police brutality. In May 1969, Renaldo 'Obie  Benson, the Four Tops' bass singer, watched TV coverage of hundreds of club-wielding cops breaking up the People's Park, a protest hub in Berkeley. Aghast at the violence, Benson began to write a song with Motown lyricist Al Cleveland, trying to capture the confusion and pain of the times. He knew he had something big in his nascent version of 'What's Going On,  but the rest of the Four Tops weren't interested, and Benson's efforts to get Joan Baez to record it didn't work out, either.",
      "Image":"https://upload.wikimedia.org/wikipedia/en/8/84/MarvinGayeWhat%27sGoingOnalbumcover.jpg"
    }
   ]